In [8]:
import pandas as pd

In [4]:
datos = {'nombre': ['Pedro', 'Juan', 'Lorena'], 'edad':[25,39,33]}
datos

{'nombre': ['Pedro', 'Juan', 'Lorena'], 'edad': [25, 39, 33]}

In [10]:
# Esto es para convertir una lista, diccionario, tupla de datos en tablas
# y poder manipular los datos con pandas para data science
df = pd.DataFrame(datos)
df

   nombre  edad
0   Pedro    25
1    Juan    39
2  Lorena    33

In [12]:
df_employees = {'nombre': ['Ana', 'Luis', 'Carlos'], 'edad': [30,25,40]}
df2 = pd.DataFrame(df_employees)
df2

   nombre  edad
0     Ana    30
1    Luis    25
2  Carlos    40

In [13]:
df_employees = {'nombre': ['Ana', 'Luis', 'Carlos'], 'edad': [30,25,40]}
df = pd.DataFrame(df_employees)
df['edad']

0    30
1    25
2    40
Name: edad, dtype: int64